fio/test_suite_sd_results/bs16k_read80write20.txt
bs16k_read80write20: (g=0): rw=randrw, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs16k_read80write20: Laying out IO file (1 file / 100MiB)
bs16k_read80write20: Laying out IO file (1 file / 100MiB)
bs16k_read80write20: Laying out IO file (1 file / 100MiB)
[...]

bs16k_read80write20: (groupid=0, jobs=4): err= 0: pid=3340: Sun Jun  8 21:34:29 2025
  read: IOPS=564, BW=9026KiB/s (9243kB/s)(279MiB/31621msec)
    clat (usec): min=1902, max=1969.0k, avg=7039.36, stdev=35337.45
     lat (usec): min=1904, max=1969.0k, avg=7040.46, stdev=35337.47
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[    6], 10.00th=[    6], 20.00th=[    6],
     | 30.00th=[    6], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    7], 95.00th=[    7],
     | 99.00th=[    7], 99.50th=[    7], 99.90th=[  338], 99.95th=[  439],
     | 99.99th=[ 1972]
   bw (  KiB/s): min=  124, max=11264, per=100.00%, avg=9658.17, stdev=813.66, samples=236
   iops        : min=    4, max=  704, avg=601.73, stdev=51.00, samples=236
  write: IOPS=146, BW=2351KiB/s (2407kB/s)(72.6MiB/31621msec); 0 zone resets
    clat (usec): min=27, max=15695, avg=125.86, stdev=554.43
     lat (usec): min=28, max=15697, avg=127.98, stdev=554.46
    clat percentiles (usec):
     |  1.00th=[   31],  5.00th=[   49], 10.00th=[   51], 20.00th=[   66],
     | 30.00th=[   84], 40.00th=[   93], 50.00th=[  102], 60.00th=[  111],
     | 70.00th=[  119], 80.00th=[  126], 90.00th=[  135], 95.00th=[  151],
     | 99.00th=[  188], 99.50th=[  277], 99.90th=[11207], 99.95th=[12911],
     | 99.99th=[15664]
   bw (  KiB/s): min=  124, max= 4314, per=100.00%, avg=2685.50, stdev=207.03, samples=221
   iops        : min=    4, max=  268, avg=165.40, stdev=13.01, samples=221
  lat (usec)   : 50=1.68%, 100=8.21%, 250=10.66%, 500=0.03%, 750=0.02%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=79.09%, 20=0.12%, 500=0.12%
  lat (msec)   : 1000=0.02%, 2000=0.02%
  cpu          : usr=0.34%, sys=1.77%, ctx=17928, majf=0, minf=112
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=17839,4646,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=9026KiB/s (9243kB/s), 9026KiB/s-9026KiB/s (9243kB/s-9243kB/s), io=279MiB (292MB), run=31621-31621msec
  WRITE: bw=2351KiB/s (2407kB/s), 2351KiB/s-2351KiB/s (2407kB/s-2407kB/s), io=72.6MiB (76.1MB), run=31621-31621msec

Disk stats (read/write):
  mmcblk0: ios=17835/230, merge=0/8, ticks=115015/380354, in_queue=495369, util=89.11%