fio/test_suite_sd_results/bs16k_write100.txt
bs16k_write100: (g=0): rw=write, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs16k_write100: Laying out IO file (1 file / 100MiB)
bs16k_write100: Laying out IO file (1 file / 100MiB)
bs16k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs16k_write100: (groupid=0, jobs=4): err= 0: pid=3389: Sun Jun  8 21:39:36 2025
  write: IOPS=412, BW=6603KiB/s (6761kB/s)(193MiB/30006msec); 0 zone resets
    clat (usec): min=26, max=12075k, avg=9683.78, stdev=247198.87
     lat (usec): min=27, max=12075k, avg=9685.25, stdev=247198.92
    clat percentiles (usec):
     |  1.00th=[      36],  5.00th=[      42], 10.00th=[      44],
     | 20.00th=[      47], 30.00th=[      50], 40.00th=[      53],
     | 50.00th=[      56], 60.00th=[      58], 70.00th=[      63],
     | 80.00th=[      72], 90.00th=[     102], 95.00th=[     172],
     | 99.00th=[   99091], 99.50th=[  114820], 99.90th=[  139461],
     | 99.95th=[ 6610224], 99.99th=[12012487]
   bw (  KiB/s): min= 4148, max=232032, per=100.00%, avg=16494.21, stdev=11359.12, samples=96
   iops        : min=  256, max=14502, avg=1029.08, stdev=710.04, samples=96
  lat (usec)   : 50=31.48%, 100=58.05%, 250=6.05%, 500=0.20%, 750=0.03%
  lat (usec)   : 1000=0.12%
  lat (msec)   : 2=0.02%, 4=0.01%, 20=0.01%, 100=3.13%, 250=0.84%
  lat (msec)   : >=2000=0.06%
  cpu          : usr=0.08%, sys=0.68%, ctx=764, majf=0, minf=113
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,12383,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=6603KiB/s (6761kB/s), 6603KiB/s-6603KiB/s (6761kB/s-6761kB/s), io=193MiB (203MB), run=30006-30006msec

Disk stats (read/write):
  mmcblk0: ios=0/268, merge=0/33, ticks=0/1720449, in_queue=1720449, util=94.58%