fio/test_suite_sd_results/bs256k_write100.txt
bs256k_write100: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs256k_write100: Laying out IO file (1 file / 100MiB)
bs256k_write100: Laying out IO file (1 file / 100MiB)
bs256k_write100: Laying out IO file (1 file / 100MiB)
[...]

bs256k_write100: (groupid=0, jobs=4): err= 0: pid=3748: Sun Jun  8 22:17:27 2025
  write: IOPS=31, BW=8115KiB/s (8309kB/s)(242MiB/30507msec); 0 zone resets
    clat (usec): min=635, max=10892k, avg=124938.52, stdev=874511.71
     lat (usec): min=691, max=10892k, avg=125102.76, stdev=874500.51
    clat percentiles (usec):
     |  1.00th=[     832],  5.00th=[    1205], 10.00th=[    1319],
     | 20.00th=[    1434], 30.00th=[    1500], 40.00th=[    1582],
     | 50.00th=[    1647], 60.00th=[    1762], 70.00th=[    1926],
     | 80.00th=[    2245], 90.00th=[  183501], 95.00th=[  204473],
     | 99.00th=[ 4999611], 99.50th=[ 6408897], 99.90th=[10938745],
     | 99.95th=[10938745], 99.99th=[10938745]
   bw (  KiB/s): min= 2046, max=224768, per=100.00%, avg=29909.83, stdev=14150.88, samples=66
   iops        : min=    7, max=  878, avg=116.26, stdev=55.29, samples=66
  lat (usec)   : 750=0.41%, 1000=2.38%
  lat (msec)   : 2=70.53%, 4=11.38%, 10=2.28%, 20=1.14%, 100=0.31%
  lat (msec)   : 250=8.38%, 500=1.03%, 750=0.10%, 1000=0.10%, 2000=0.72%
  lat (msec)   : >=2000=1.24%
  cpu          : usr=0.17%, sys=1.25%, ctx=427, majf=0, minf=106
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,967,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=8115KiB/s (8309kB/s), 8115KiB/s-8115KiB/s (8309kB/s-8309kB/s), io=242MiB (253MB), run=30507-30507msec

Disk stats (read/write):
  mmcblk0: ios=1/266, merge=0/57, ticks=13/1379726, in_queue=1379739, util=97.61%